[
  {
    "title": "2x MMR DAY",
    "date": "2024-05-03T08:20:00",
    "converted_date": "May 3rd, 2024",
    "content": "Hey all, after talking to some faculty folk here we would like to test out what I call gambling day.\n\nThroughout today all matches will be worth double points EDIT: we have made it so losses still deduct the same amount of points so fear not of losing double.\n\nWe are interested in seeing if this will promote activity or stunt it- so please share your thoughts and we will revert back to normal elo gain/loss in 12 hours."
  },
  {
    "title": "1000 member surprise and other updates",
    "date": "2024-05-03T20:29:00",
    "converted_date": "May 3rd, 2024",
    "content": "Hello everyone! Small lil’ update for everyone.\n\nFirstly, thank you to everyone who participated in the 2x MMR day- we had a lot of participation and the technical side went off flawlessly. I will be including a poll in the near future to discuss a potential weekly +50% MMR day.\n\nLastly, as you may have read. We are rapidly approaching 1000 members and we would like all the help you guys can give to push us there as once at 1000 members we can apply for Discord Discovery. So as a little push and a thank you for everyone we will offer three potential events that you all will get to vote on- until we reach 1000 members the events will be hidden will be revealed once we reach our goal! \n\nThank you everyone for helping make this server thrive! Looking forward to our future!"
  },
  {
    "title": "Double Random Tournament + World Cup Sign-Up!",
    "date": "2024-05-04T21:12:00",
    "converted_date": "May 4th, 2024",
    "content": "Hi all! Sorry for the delay- as the end of the S2 Master 1v1 Tournament is coming to an end- we would like to start taking submissions for the upcoming world cup and double random tournament.\n\nAs the World Cup is one of our largest events it is crucial to start preparing on our end immediately, overall, the World cup will follow the same group stage if necessary and will be First Come First Serve for the first 12 in each country (6 per team).\n\nAny other questions feel free to ask Gussie or any staff-\n\nGreat things ahead and Bopl on,\nGussie\n\nhttps://forms.gle/5Ktx1dMW9j7FR3uk8\nhttps://forms.gle/wDZeZjCvm92ikPim7"
  },
  {
    "title": "Streaming Masters SEMI FINALS + 3rd PLACE",
    "date": "2024-05-05T13:08:00",
    "converted_date": "May 5th, 2024",
    "content": "Streaming Masters SEMI FINALS + 3rd PLACE\n\nhttps://www.twitch.tv/gussie_luny"
  },
  {
    "title": "Quality of Life Update",
    "date": "2024-05-08T10:31:00",
    "converted_date": "May 8th, 2024",
    "content": "Hi all, tiny update here hence no ping. After ~60 votes the clear favorite is in. Starting World Cup we will limit ability bans to 1 per team.\n\nIt is also important to mention the Double Random Tournament will not have any bans or unbans as having 2 ability slots as random is already very limiting.\n\nIn addition, after prolonged discussion we will be reworking season 2 points to make them more equitable to all. This means the points for masters tournament will be declined whereas points for participating will be increased, all of this and a bit more to come!\n\nThanks all! Bopl On'\n-Gussie\n\nP.S We are still looking for a social media coordinator- so if you are interested please let me know"
  },
  {
    "title": "Tournament Elo",
    "date": "2024-05-13T20:20:00",
    "converted_date": "May 13th, 2024",
    "content": "Hello everybody! Excited to announce our partnership with Bopl Bros and @[150] Noah ! From now on every tournament we host and tournaments from other servers will be tracked and recorded for a universal rating! For those who have competed in the Double Random Tournament you can find your Elo below!\n\nhttps://sites.google.com/view/boplbros/bopl-bros-ratings\n\nWe still will have our own elo just for our server- this is a universal system through multiple servers"
  },
  {
    "title": "WE BEGIN SOON",
    "date": "2024-05-18T13:10:00",
    "converted_date": "May 18th, 2024",
    "content": "As the final moments of the Double Random are coming to an end- I will be organizing the final teams and looking for last minute sign ups.\n\nStart date: Monday, May 20th 2024\n\nPlease use this next day to confirm you are signed up and in your preferred country\n\nIf you have signed up recently please allow Gussie ~24 hours to update ⁠countries\n\nOtherwise please contact Gussie or a Mod if something is wrong and we will be sure to answer your questions quickly!\n\nBopl on,\nGussie\n\nImportant World Cup Update! ^^^^^^"
  },
  {
    "title": "Streaming world cup matches!",
    "date": "2024-05-20T12:01:00",
    "converted_date": "May 20th, 2024",
    "content": "Streaming world cup matches!\n\nhttps://www.twitch.tv/gussie_luny"
  },
  {
    "title": "Bopl Battle @Media Role!",
    "date": "2024-05-30T19:29:00",
    "converted_date": "May 30th, 2024",
    "content": "Are you a youtuber or streamer and want a cool role??? Fill this out and ping @[512] BG Gussie  to get one!\n\nhttps://forms.gle/tSQ7GRgu2JLHJ9yG9"
  },
  {
    "title": "Coming soon…",
    "date": "2024-05-31T19:31:00",
    "converted_date": "May 31st, 2024",
    "content": "Coming soon…"
  },
  {
    "title": "4 away from 1000 members! Special gift soon…",
    "date": "2024-06-01T19:54:00",
    "converted_date": "June 1st, 2024",
    "content": "4 away from 1000 members! Special gift soon… \nAlso invite your friends- if they are #1000 they get a special role!"
  },
  {
    "title": "Thank you @[224] Cac for permission to use their emoji's and stickers!",
    "date": "2024-06-02T10:56:00",
    "converted_date": "June 2nd, 2024",
    "content": "Thank you @[224] Cac for permission to use their emoji's and stickers!"
  },
  {
    "title": "Thank you gift!",
    "date": "2024-06-04T15:44:00",
    "converted_date": "June 4th, 2024",
    "content": "Thank you everyone for being part of this community- as a thank you for reaching 1000 members we will now be hosting 200% Elo once a week! to decide what day we host it on please respond to the poll below! \n\nWhat day of the week should be 200% MMR?\nPoll closed"
  },
  {
    "title": "Also thank you Arch Angel Gabriel (Aaron) for drawing the emojis and giving me permission to use them!",
    "date": "2024-06-04T18:31:00",
    "converted_date": "June 4th, 2024",
    "content": "Also thank you Arch Angel Gabriel (Aaron) for drawing the emojis and giving me permission to use them!"
  },
  {
    "title": "We are planning on doing other unique weekly events. If you have any suggestions please DM me or Gussie",
    "date": "2024-06-04T19:55:00",
    "converted_date": "June 4th, 2024",
    "content": "We are planning on doing other unique weekly events. If you have any suggestions please DM me or Gussie"
  },
  {
    "title": "Results are in! Every Saturday from 12:00am-11:59pm GMT -5 will be 200% MMR",
    "date": "2024-06-06T11:28:00",
    "converted_date": "June 6th, 2024",
    "content": "Results are in! Every Saturday from 12:00am-11:59pm GMT -5 will be 200% MMR"
  },
  {
    "title": "Thank you everyone for signing up for the S3 2v2 Tournament!",
    "date": "2024-06-07T19:20:00",
    "converted_date": "June 7th, 2024",
    "content": "Thank you everyone for signing up for the S3 2v2 Tournament!\nThere's still time to sign up... This may be our largest tournament yet (look in ⁠tournament-brackets for teams!)\n\nhttps://forms.gle/vhdepSNT3fAvw82z5"
  },
  {
    "title": "Small QoL Update!",
    "date": "2024-06-14T15:20:00",
    "converted_date": "June 14th, 2024",
    "content": "Emoji's thank you @Zahirgamer444 and JustDave2 (isn't in server:boplSad: ) for the emoji's!\n\nELO System:\nNew names and quotas (thanks to @[512] [-∞] SB savaGe  for the help)\nBelow will be the new ranks and elo to reach them (can also be found @ ⁠🌐・s3-info-and-sign-up ):\n\nNewbie  - 0-99 ELO\n\nNovice  - 100-199 ELO \n\nIntermediate  - 200-299 ELO\n\nAdvanced - 300-499 ELO\n\nExpert  - 500-699 ELO\n\nSupreme - 700-999 ELO\n\nBoundless -  1000 - ∞ ELO\n\nWith this system adjustment we will set base ELO win/loss for both doubles and singles @ 10 ELO!\n\nThank you to everyone who helps this server thrive through continued activity and as always let me or staff know if you have any problems!\n\nBopl on,\nGussie\n\n(P.S. We are also testing with Low, Medium, and High ranked queues)"
  }
]
